{"data":{"site":{"siteMetadata":{"title":"Musings","author":"Ivan Bila"}},"markdownRemark":{"id":"643b2a86-fb17-5c41-944f-04dab1ef0c53","excerpt":"There are a few things that developers can do that can improve the overall user experience in an application; he/she may not need to take a UX course to learn…","html":"<p>There are a few things that developers can do that can improve the overall user experience in an application; he/she may not need to take a UX course to learn.</p>\n<p>However, when passed unnoticed can damage the application’s experience; on the other hand, if you spend some time and correct them, it can improve the application’s user experience significantly.</p>\n<h3>Prove the value of your app</h3>\n<p>Imagine being asked for your ID copy/credit card before entering a shop? How would you feel? That’s how users feel when you ask for their data before they can even use your app, what I’m saying is we should Let the user do something in our apps without requiring him to sign up. It is not enough to put a splash screen or a short tutorial on how the app works to establish whether your application is worth it or not.</p>\n<blockquote>\n<p>“If you ask me for my data before offering any value, that means you’re more concerned with my data than with solving my problem.” Rushing User</p>\n</blockquote>\n<p>I think the statement above sums it up. It would be best if you didn’t ask for a user to sign-in or give in (his) data before even showing him why your app deserves (his) attention or data. I know some apps need to know about the user before him using it, but I think you can always figure a way to give value before you ask for it.</p>\n<blockquote>\n<p>Give value to your users before you ask for it.</p>\n</blockquote>\n<h3>Prefer OAuth over traditional email-password</h3>\n<p>When a user signs up using traditional email-password, he has to memorize the password for your specific application or even worse in some cases he might re-use a password(unless he uses a password management/generator app).</p>\n<p>Some users tend to re-use or create weak passwords for most applications they use, to avoid laborious work of memorizing or saving in a password manager. </p>\n<p>Having to memorize things is a pain, laborious and time consuming, usually users have many things to keep track of (tasks, family names, phone numbers), so it’s improbable that they’ll memorize your apps’ password, they have zillions of apps, you want to make your app easy to use without the hassle of remembering passwords and emails. To prevent this, you can use OAuth.</p>\n<p>With OAuth, the user doesn’t need to memorize a password or username(in short it allows passwordless sign-in/up), signing-in or signing-up is only a “tap/click away,” meaning he only has to allow your application to access his/her data. </p>\n<p>This flow tends to be less laborious for the user because he/she doesn’t have to memorize a password and then verify if the email was filled correctly. Using the OAuth flow implies that you don’t have to implement the logic for resetting the password(unless you have users signed-in in using email-password) that the user is likely to forget over and over again until he/she stops using your service.</p>\n<p>By using OAuth not only you have the convenience of signing in the user in without requiring a password you also have access to the information(first name, last name, age and more) that the user has already filled in his/her account.</p>\n<p>Whether you should use Google, Twitter, Facebook, Linkedin or GitHub OAuth provider can depend based on your needs, however, more often than not, you’ll use more than one OAuth provider.</p>\n<p>Given that Facebook and Google are the providers with the most users, I’ll compare both and say why and when I’d use one over of the other.</p>\n<p>Google and Facebook allow you to get almost the same information for a given user, but using one or the other might have different user experience implications to your application.</p>\n<p>Usually, the flow is the same/close, and you click to register or sign-in then you get redirected to a page where you can either accept, declined or accept but customize(I can only s see this feature on Facebook) what information the app can get from your account.</p>\n<p>On mobile most specifically Android, when you sign in or sign up with Facebook, it usually opens a web browser tab which can be expensive for the user. </p>\n<p>Opening the browser or external apps uses RAM and processing power, which is not what you want your app to do, because most devices have low RAM, and processing power is scarce, even if they have good processing power it’s very likely that they opened dozen other apps besides yours.</p>\n<p>Another disadvantage of opening a browser/app for signing-in/up is the loss of the attention of the user because he is taken to a different place where he might find distractions, and who knows whether he’ll return?</p>\n<p>Google has come out with some exciting features to speed up the sign flow using, for the web they created something called one tap sign-up or auto sign-in which allows seamless sign-in and sign-up flows without interrupting them with a sign-on or sign-up screen.</p>\n<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/377cdfea2aef6bacdff9bec166b0ac3a/4f3bc/auto-sign-in.png\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 56.25%; position: relative; bottom: 0; left: 0; background-image: url('data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAALCAYAAAB/Ca1DAAAACXBIWXMAAAsSAAALEgHS3X78AAACMUlEQVQoz22RzU4TURTHRySx063gylV1o2/QNOm09OsJTFwZiibKdCoCz2BMTEQWoKig0SdwgUhCauLS+IGYztDEIEjCRrFj7UznDjP3/r33dhrGxJP7n3PuOWd+90tRuKmqmtJ1nfiuA+J5jPg+CCHo9XrwPE9KzIMgQBiGcVFuMAzD4YwLysASajJV0ydJt+fA9XzmdLsS4rquhArf6XQkkDEGARFeAAVYABOJxDFQVRMpvWYQn3g4PGgxDsXXnV3sfNvD7t4+eh7BUUARUoYg7EvM+aDg1gfGdpgUQL1GAD46LQb46Pzch/3jO/78OoDvHALUwX9MAmvyyLEdnhhOpqbqk2R9K8SdVcbm1nzMvQ6wsBFg5W2IR28CLG4cYanhY36d4O4qwb1XBLdfErrG/5m5ZThDwzGgMpRMTd/UyXLDwaX7bTbxsI0rC21cf2xj9oWNGa6pZ9w//40bT2yML9qoPrBxeb5NlxsuZqcNRzn5zx0m5StHx2ByxBSEEPfVj7kPo5hXacA/9brhnIo/yujomVS1Ok42v1homhYzTRPNZpPLxLZl4v1mEx8+m2jJ2MS7TyYsS+Qs+nFrG9euTjinR0aOgWNjY+c0TfNymoZsNssiiRg8j3K5hHKpJGNNy0oN+vo5rZvP5y/GgWdzuRzlEkUqwFGMYrGIEocVCgXp5SJRjfdRDhK9hPvzEpbJZKTnyZWoKMBsABS5SqUiJWItWizqGQCfCkY6nVb+Ahh1GXTjkF3dAAAAAElFTkSuQmCC'); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"auto sign in\"\n        title=\"\"\n        src=\"/static/377cdfea2aef6bacdff9bec166b0ac3a/b9e4f/auto-sign-in.png\"\n        srcset=\"/static/377cdfea2aef6bacdff9bec166b0ac3a/cf440/auto-sign-in.png 148w,\n/static/377cdfea2aef6bacdff9bec166b0ac3a/d2d38/auto-sign-in.png 295w,\n/static/377cdfea2aef6bacdff9bec166b0ac3a/b9e4f/auto-sign-in.png 590w,\n/static/377cdfea2aef6bacdff9bec166b0ac3a/4f3bc/auto-sign-in.png 688w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    \nOne tap sign in pop up\n\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/5ae9c3a373c4688216468522483c81f4/4f3bc/auto-sign-up.png\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 56.25%; position: relative; bottom: 0; left: 0; background-image: url('data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAALCAYAAAB/Ca1DAAAACXBIWXMAAAsSAAALEgHS3X78AAAB00lEQVQoz42R3W7aQBCFqdQK8G1pr3pFe9O+AUJizV94jabJjRGJ+hx9h/Yp2ofoX2iDTS5AQil14oALjbDxYrx7OmublFRB6krHczQz+nbGm8nQ0TStaBgGR3Ik/v8I9el0Ol4ul3ue2Zw8AdvtNlck23Hl5WSGc/sK9qWLq+kMP+wJxhfTVBO4s2tcOK7q3QHM52Mg9xaYz6/lr9kcC8/HMuAI+Ar+MrglvlohoBrVb4DE+HdCgy+5T0uspE/gKIp27imljLW98i3gvfta8fVxmw8ciTfvQ6kmGw4HGAyHGI1G8H0fYRjegLZ098oPslrxqGNw53eED91QqnVs+yfG4zEcx4HrTuHR1EIoCDFIUSSUv3tCLX2UXa+8pkwoEh+sgWWYeL6GCOjPHB91vGx2a8LCo8fF/f2XvHvax2nPkpZpotfrkUxYlolPJyY+d02c9VW08PHEQp/8l2+W+Pr9DIcHr7yHhcJfYK1We8oYC3TGwCoVWUkEJcpjb68ZS3nGKtBZXJPkZZJji2q1+mIb+ETXdUFSRaHAqUej0UCz2US9Xo9jfElaoz5BINXLKT6LYeVyOY6UfJsWFVhugCrXarViKc/Sy9KeDfCdYpRKpcwfnF0sonZR6rwAAAAASUVORK5CYII='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"auto sign in\"\n        title=\"\"\n        src=\"/static/5ae9c3a373c4688216468522483c81f4/b9e4f/auto-sign-up.png\"\n        srcset=\"/static/5ae9c3a373c4688216468522483c81f4/cf440/auto-sign-up.png 148w,\n/static/5ae9c3a373c4688216468522483c81f4/d2d38/auto-sign-up.png 295w,\n/static/5ae9c3a373c4688216468522483c81f4/b9e4f/auto-sign-up.png 590w,\n/static/5ae9c3a373c4688216468522483c81f4/4f3bc/auto-sign-up.png 688w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p>On Android, Google allows users to sign-in or sign-up without leaving having to leave the application, by showing a modal of the list of accounts that the user setup in that device and wants to use in your application.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">    [TODO: add android sign-in image]</code></pre></div>\n<h3>Don’t ask them to invite their friends nor rate you</h3>\n<p>Seriously, I don’t think users invite other people to use an app. No one does that. It’s odd and weird. If I want my friend to use this X app, I tell him to download and explain the benefits and tell him how cool I’m because I’m using it or how it has changed, improved or helped me doing Y thing. Word of mouth is the kind of invitation or recommendation that people want, not receiving a message or an email saying user X invited you to use this app, how is the app supposed to solve my problem if it’s already creating a new one by spamming me?</p>\n<h3>Use appropriate language</h3>\n<p>Unlike other extremely formal fields like architecture and law, in software, no one will come and suspend your app because the language is not grammatically correct(there are some edge cases where the language has to follow  strictly the rules of grammar and so forth), or it used words that do not exist in the dictionary.</p>\n<p>When building your app prefer a language that is easy to grasp and in the context. (It doesn’t have to be grammatically correct, though this is not an appeal to ignore the grammar entirely, there are tiny things you can do or change in your language to make it easier to understand to your specific users).</p>\n<p>The inadequate use of language can cause doubt, uncertainty, hesitation, ambiguity, misinformation.</p>\n<p>Long texts can hinder your user’s experience as in he or she might be using a mobile device which does not have a large screen.</p>","frontmatter":{"title":"How developers can improve ux","date":"April 27, 2019","description":""}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/how-developers-can-improve-ux/","previous":null,"next":null}}